## State Student Spending Case Study
### Examining any relationship between student sucess or lack thereof with spending

### Necessary Steps for Data Story
#### 1) Clean the Data 
    a. Import Data
    b. Transform variables
#### 2) Exploratory Data Analysis
    a. Visualize the data
#### 3) Preprocess and Train Data
#### 4) Create Machine Learning Model
#### 5) Summarize Findings

In [1]:
#import necessary modules

import pandas as pd
import numpy as np

# Begin Importing and Cleaning Data

In [2]:
#import csv data
Grad = pd.read_csv('Data/Completion1318edit.csv')
Drop = pd.read_csv('Data/Dropout1318edit.csv')
StateSpend = pd.read_excel('Data/StateSpendingStudents.xlsx')
Pop = pd.read_csv('Data/Pop10-19.csv')

## Cleaning Tax Data

In [3]:
#import tax data 
Tax13 = pd.read_csv('Data/2013 State Taxes.csv')
Tax14 = pd.read_csv('Data/2014 State Taxes.csv')
Tax15 = pd.read_csv('Data/2015 State Taxes.csv')
Tax16 = pd.read_csv('Data/2016 State Taxes.csv')
Tax17 = pd.read_csv('Data/2017 State Taxes.csv')
Tax18 = pd.read_csv('Data/2018 State Taxes.csv')
Tax19 = pd.read_csv('Data/2019 State Taxes.csv')


#Note to self to automate process:
#Try a dictionary. Start with empty dictionary. Wild cards to read itieratively * .csv

In [4]:
#Examing the column names: Need to change them to match the rest of the data
Tax13.columns

Index(['Unnamed: 0', 'AL', 'AK', 'AZ', 'AR', 'CA', 'CO', 'CT', 'DE', 'DC',
       'FL', 'GA', 'HI', 'ID', 'IL', 'IN', 'IA', 'KS', 'KY', 'LA', 'ME', 'MD',
       'MA', 'MI', 'MN', 'MS', 'MO', 'MT', 'NE', 'NV', 'NH', 'NJ', 'NM', 'NY',
       'NC', 'ND', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX', 'UT',
       'VT', 'VA', 'WA', 'WV', 'WI', 'WY'],
      dtype='object')

In [5]:
#Dictionary to change state abbreviations to full state names
us_state_abbrev = {
    'AL': 'Alabama',
    'AK': 'Alaska',
    'AZ': 'Arizona',
    'AR': 'Arkansas',
    'CA': 'California',
    'CO': 'Colorado',
    'CT': 'Connecticut',
    'DE': 'Delaware',
    'FL': 'Florida',
    'GA': 'Georgia',
    'HI': 'Hawaii',
    'ID': 'Idaho',
    'IL': 'Illinois',
    'IN': 'Indiana',
    'IA': 'Iowa',
    'KS': 'Kansas',
    'KY': 'Kentucky',
    'LA': 'Louisiana',
    'ME': 'Maine',
    'MD': 'Maryland',
    'MA': 'Massachusetts',
    'MI': 'Michigan',
    'MN': 'Minnesota',
    'MS': 'Mississippi',
    'MO': 'Missouri',
    'MT': 'Montana',
    'NE': 'Nebraska',
    'NV': 'Nevada',
    'NH': 'New Hampshire',
    'NJ': 'New Jersey',
    'NM': 'New Mexico',
    'NY': 'New York',
    'NC': 'North Carolina',
    'ND': 'North Dakota',
    'OH': 'Ohio',
    'OK': 'Oklahoma',
    'OR': 'Oregon',
    'PA': 'Pennsylvania',
    'RI': 'Rhode Island',
    'SC': 'South Carolina',
    'SD': 'South Dakota',
    'TN': 'Tennessee',
    'TX': 'Texas',
    'UT': 'Utah',
    'VT': 'Vermont',
    'VA': 'Virginia',
    'WA': 'Washington',
    'WV': 'West Virginia',
    'WI': 'Wisconsin',
    'WY': 'Wyoming',
    'District of Columbia': 'DC',
}

In [13]:
TaxList = [Tax13, Tax14, Tax15, Tax16, Tax17, Tax18, Tax19]

#Append all the tax files into a single data frame.
tax_final = pd.DataFrame()

for df in TaxList:
    tax_final = tax_final.append(df)

#Find Total Taxes
tax_final['Total Taxes'] = tax_final.sum(axis = 1, skipna = True)

#Rename State Abbreviations
tax_final = tax_final.rename(columns = us_state_abbrev)


#THIS IS INCORRECT
#Then use melt function on this single data frame.
#tax_final = tax_final.melt(id_vars = ['State'], var_name='Year', value_name = 'Taxes')

#Examine
print(tax_final.head())

KeyError: "The following 'id_vars' are not present in the DataFrame: ['State']"

In [11]:
print(df_final['Total Taxes'])

0      22041372
1     348999491
2       7117646
3       8575812
4      24316484
        ...
20     63434214
21      5170048
22     10930247
23     14982719
24      3252571
Name: Total Taxes, Length: 175, dtype: int64

## Cleaning Median Income Data

In [19]:
#Read in Median Income (Deleted out Standard Deviation as well as repetitive information from original file)
MedianInc = pd.read_csv('Data/Median Income Edit.csv')

#Flip
MedianInc = MedianInc.melt(id_vars = ['State'], var_name='Year', value_name = 'MedInc')

MedianInc.head()
MedianInc.tail()
#Delete unnecessary columns and repetitive information.

              State  Year  MedInc
1850       Virginia  1984  26,525
1851     Washington  1984  25,017
1852  West Virginia  1984  16,843
1853      Wisconsin  1984  20,743
1854        Wyoming  1984  23,816

## Cleaning Graduation and Drop Out Data

In [8]:
#examine data
print(Grad.columns)

Index(['State', '2012-2013', '2013-2014', '2014-2015', '2015-2016',
       '2016-2017', '2017-2018'],
      dtype='object')

In [9]:
#Rename columns so they match years in other files.
oldname = Grad.columns
newname = ['State', 2013, 2014, 2015, 2016, 2017, 2018 ]
Grad = Grad.rename(columns=dict(zip(oldname, newname)))

#Flip so States are columns
Grad = Grad.melt(id_vars = ['State'], var_name='Year', value_name = 'Graduates')


#Examine
Grad.head()

           State  Year  Graduates
0  United States  2013       81.4
1        Alabama  2013       80.0
2         Alaska  2013       71.8
3        Arizona  2013       75.1
4       Arkansas  2013       84.9

In [10]:
#examine data
print(Drop.head())
print(Drop.columns)

           State 2013 2014 2015  2016 2017 2018
0  United States  6.8  6.3  6.0   5.8  5.4  5.3
1        Alabama  8.9  7.7  7.4   6.9  6.6  5.4
2         Alaska  6.2  2.8  8.8   5.6  5.3  4.4
3        Arizona  9.4  8.5  9.2   7.6  8.0  7.7
4       Arkansas  6.8  6.8  6.7   7.2  5.7  5.6
Index(['State', '2013', '2014', '2015', '2016', '2017', '2018'], dtype='object')

In [11]:
#Flip so States are columns
Drop = Drop.melt(id_vars = ['State'], var_name='Year', value_name = 'Dropout')

#Examine
Drop.head()

           State  Year Dropout
0  United States  2013     6.8
1        Alabama  2013     8.9
2         Alaska  2013     6.2
3        Arizona  2013     9.4
4       Arkansas  2013     6.8

## Clean State Spending Data

In [12]:
#Examine State Spending
print(StateSpend.head())

        state      1997      1998      1999      2000        2001      2002  \
0     Alabama   3271969   3504764   3784422   4006894   4140052.5   4273211
1      Alaska   1042311   1019614   1097282   1133145   1188460.5   1243776
2     Arizona   3388165   3579363   3849420   4185930   4427480.5   4669031
3    Arkansas   1960613   2127517   2224967   2324123   2451202.0   2578281
4  California  28708364  31776920  33739312  36658880  41025508.0  45392132

         2003      2004      2005  ...      2007      2008      2009  \
0   4429788.5   4586366   4925201  ...   6104470   6671430   6629154
1   1287792.0   1331808   1416771  ...   1609832   1897947   2077152
2   5087547.5   5506064   5872686  ...   6826134   7367909   7536710
3   2742677.5   2907074   3300288  ...   3719097   3846131   4189066
4  47133896.0  48875660  50693044  ...  57258252  60096496  59255344

       2010      2011      2012      2013      2014      2015      2016
0   6573857   6592386   6305709   6461916   6600333   6645129   6589890
1   2157418   2196942   2105122   2202551   2202685   2332630   2074993
2   7388074   7096432   6966512   6675200   7065613   7026131   7137123
3   4480204   4609186   4220947   4222408   4299286   4355246   4411761
4  57105136  55999628  57048604  57043384  59043948  64553292  68892072

[5 rows x 21 columns]

In [13]:
#Realign with States as columns
StateSpend.rename(columns = {'state': 'State'}, inplace = True)
StateSpend = StateSpend.melt(id_vars = ['State'], var_name='Year', value_name = 'StateSpend')
StateSpend.head()

#Examine
print(StateSpend.head())

        State  Year  StateSpend
0     Alabama  1997   3271969.0
1      Alaska  1997   1042311.0
2     Arizona  1997   3388165.0
3    Arkansas  1997   1960613.0
4  California  1997  28708364.0

## Clean Population Data

In [14]:
#Examine the Population
print(Pop.head(10))
print(Pop['Geographic Area'].head(10))
#print(Pop.rows)

  Geographic Area       Census Estimates Base         2010         2011  \
0   United States  308,745,538    308,758,105  309,321,666  311,556,874
1       Northeast   55,317,240     55,318,443   55,380,134   55,604,223
2         Midwest   66,927,001     66,929,725   66,974,416   67,157,800
3           South  114,555,744    114,563,030  114,866,680  116,006,522
4            West   71,945,553     71,946,907   72,100,436   72,788,329
5        .Alabama    4,779,736      4,780,125    4,785,437    4,799,069
6         .Alaska      710,231        710,249      713,910      722,128
7        .Arizona    6,392,017      6,392,288    6,407,172    6,472,643
8       .Arkansas    2,915,918      2,916,031    2,921,964    2,940,667
9     .California   37,253,956     37,254,519   37,319,502   37,638,369

          2012         2013         2014         2015         2016  \
0  313,830,990  315,993,715  318,301,008  320,635,163  322,941,311
1   55,775,216   55,901,806   56,006,011   56,034,684   56,042,330
2   67,336,743   67,560,379   67,745,167   67,860,583   67,987,540
3  117,241,208  118,364,400  119,624,037  120,997,341  122,351,760
4   73,477,823   74,167,130   74,925,793   75,742,555   76,559,681
5    4,815,588    4,830,081    4,841,799    4,852,347    4,863,525
6      730,443      737,068      736,283      737,498      741,456
7    6,554,978    6,632,764    6,730,413    6,829,676    6,941,072
8    2,952,164    2,959,400    2,967,392    2,978,048    2,989,918
9   37,948,800   38,260,787   38,596,972   38,918,045   39,167,117

          2017         2018         2019
0  324,985,539  326,687,501  328,239,523
1   56,059,240   56,046,620   55,982,803
2   68,126,781   68,236,628   68,329,004
3  123,542,189  124,569,433  125,580,448
4   77,257,329   77,834,820   78,347,268
5    4,874,486    4,887,681    4,903,185
6      739,700      735,139      731,545
7    7,044,008    7,158,024    7,278,717
8    3,001,345    3,009,733    3,017,804
9   39,358,497   39,461,588   39,512,223
0    United States
1        Northeast
2          Midwest
3            South
4             West
5         .Alabama
6          .Alaska
7         .Arizona
8        .Arkansas
9      .California
Name: Geographic Area, dtype: object

In [15]:
#Fix geographic area names
Pop['Geographic Area'] = Pop['Geographic Area'].str.replace('.','')
print(Pop['Geographic Area'].head(10))

0    United States
1        Northeast
2          Midwest
3            South
4             West
5          Alabama
6           Alaska
7          Arizona
8         Arkansas
9       California
Name: Geographic Area, dtype: object

In [16]:
#Drop the US regions
Pop = Pop.drop([0,1,2,3,4,])
Pop = Pop.reset_index(drop = True)
Pop.head(10)

,Geographic Area,Census,Estimates Base,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Alabama,"4,779,736","4,780,125","4,785,437","4,799,069","4,815,588","4,830,081","4,841,799","4,852,347","4,863,525","4,874,486","4,887,681","4,903,185"
1,Alaska,"710,231","710,249","713,910","722,128","730,443","737,068","736,283","737,498","741,456","739,700","735,139","731,545"
2,Arizona,"6,392,017","6,392,288","6,407,172","6,472,643","6,554,978","6,632,764","6,730,413","6,829,676","6,941,072","7,044,008","7,158,024","7,278,717"
3,Arkansas,"2,915,918","2,916,031","2,921,964","2,940,667","2,952,164","2,959,400","2,967,392","2,978,048","2,989,918","3,001,345","3,009,733","3,017,804"
4,California,"37,253,956","37,254,519","37,319,502","37,638,369","37,948,800","38,260,787","38,596,972","38,918,045","39,167,117","39,358,497","39,461,588","39,512,223"
5,Colorado,"5,029,196","5,029,319","5,047,349","5,121,108","5,192,647","5,269,035","5,350,101","5,450,623","5,539,215","5,611,885","5,691,287","5,758,736"
6,Connecticut,"3,574,097","3,574,147","3,579,114","3,588,283","3,594,547","3,594,841","3,594,524","3,587,122","3,578,141","3,573,297","3,571,520","3,565,287"
7,Delaware,"897,934","897,937","899,593","907,381","915,179","923,576","932,487","941,252","948,921","956,823","965,479","973,764"
8,District of Columbia,"601,723","601,767","605,226","619,800","634,924","650,581","662,328","675,400","685,815","694,906","701,547","705,749"
9,Florida,"18,801,310","18,804,564","18,845,537","19,053,237","19,297,822","19,545,621","19,845,911","20,209,042","20,613,477","20,963,613","21,244,317","21,477,737"

In [17]:
#Decided to delete from csv file instead

#Clean up last bit of nonesense at bottom of file
#Pop = Pop.drop([51,52,53,54,55,56,57])
#print(Pop['Geographic Area'])

0                  Alabama
1                   Alaska
2                  Arizona
3                 Arkansas
4               California
5                 Colorado
6              Connecticut
7                 Delaware
8     District of Columbia
9                  Florida
10                 Georgia
11                  Hawaii
12                   Idaho
13                Illinois
14                 Indiana
15                    Iowa
16                  Kansas
17                Kentucky
18               Louisiana
19                   Maine
20                Maryland
21           Massachusetts
22                Michigan
23               Minnesota
24             Mississippi
25                Missouri
26                 Montana
27                Nebraska
28                  Nevada
29           New Hampshire
30              New Jersey
31              New Mexico
32                New York
33          North Carolina
34            North Dakota
35                    Ohio
36                Oklahoma
37                  Oregon
38            Pennsylvania
39            Rhode Island
40          South Carolina
41            South Dakota
42               Tennessee
43                   Texas
44                    Utah
45                 Vermont
46                Virginia
47              Washington
48           West Virginia
49               Wisconsin
50                 Wyoming
Name: Geographic Area, dtype: object

In [18]:
#Flip Columns
Pop.rename(columns = {'Geographic Area': 'State'}, inplace = True)
Pop = Pop.melt(id_vars = ['State'], var_name='Year', value_name = 'Population')
Pop.head()

        State    Year  Population
0     Alabama  Census   4,779,736
1      Alaska  Census     710,231
2     Arizona  Census   6,392,017
3    Arkansas  Census   2,915,918
4  California  Census  37,253,956

## Merge ALL the clean files

In [19]:
#Change them all to strings because??

Grad['Year'] = Grad['Year'].astype('str')
Grad['State'] = Grad['State'].astype('str')

Drop['Year'] = Drop['Year'].astype('str')
Drop['State'] = Drop['State'].astype('str')

StateSpend['Year'] = StateSpend['Year'].astype('str')
StateSpend['State'] = StateSpend['State'].astype('str')

Pop['Year'] = Pop['Year'].astype('str')
Pop['State'] = Pop['State'].astype('str')

In [20]:
#merge graduate and drop data
grad_drop_merge = Grad.merge(Drop, on = ['Year', 'State'], how = 'left')
grad_drop_merge.head()

           State  Year  Graduates Dropout
0  United States  2013       81.4     6.8
1        Alabama  2013       80.0     8.9
2         Alaska  2013       71.8     6.2
3        Arizona  2013       75.1     9.4
4       Arkansas  2013       84.9     6.8

In [21]:
#Merge state spending data
all_spend_merge = grad_drop_merge.merge(StateSpend, on = ['Year', 'State'], how = 'left')
all_spend_merge.head()

           State  Year  Graduates Dropout  StateSpend
0  United States  2013       81.4     6.8         NaN
1        Alabama  2013       80.0     8.9   6461916.0
2         Alaska  2013       71.8     6.2   2202551.0
3        Arizona  2013       75.1     9.4   6675200.0
4       Arkansas  2013       84.9     6.8   4222408.0

In [22]:
# Merge in population
all_merge = all_spend_merge.merge(Pop, on = ['Year', 'State'], how = 'left')
all_merge.head()

           State  Year  Graduates Dropout  StateSpend Population
0  United States  2013       81.4     6.8         NaN        NaN
1        Alabama  2013       80.0     8.9   6461916.0  4,830,081
2         Alaska  2013       71.8     6.2   2202551.0    737,068
3        Arizona  2013       75.1     9.4   6675200.0  6,632,764
4       Arkansas  2013       84.9     6.8   4222408.0  2,959,400

# Begin Exploratory Data Analysis

In [23]:
#Limit to years of interest
#StateSpendTrain = StateSpend.iloc[16:20]

#State Spend Documentation ends after 2016
#StateSpendTest = StateSpend.iloc[19:]

#print(StateSpendTrain)
#print(StateSpendTest)